{
    "deadlines": "MCA admissions close on September 30, 2025. Late applications are accepted until October 15 with a late fee.",
    "eligibility": "Eligibility: Bachelor's degree with at least 50% marks and a valid entrance exam score.",
    "fees": "The total tuition fee is ₹1,20,000 per year. Scholarships are offered to the top 10% scorers.",
    "contact": "Email: mcaadmissions@spcputtur.ac.in | Phone: +91-0123456789",
    "programs": "We offer MCA programs with specializations in Artificial Intelligence, Cybersecurity, and Data Science.",
    "installments": "You will be given 2 installments to pay the yearly fee.",
    "hostel": "Yes, hostel accommodation is available for both boys and girls with mess facilities and 24/7 security.",
    "placements": "The placement cell has partnerships with top IT companies. 85% of students get placed each year.",
    "scholarships": "Merit-based scholarships are available. Students scoring above 85% in UG can apply.",
    "documents": "You need to submit UG mark sheets, entrance scorecard, passport photo, ID proof, and transfer certificate.",
    "duration": "The MCA program is a 2-year full-time course divided into 4 semesters.",
    "syllabus": "The syllabus includes Programming in Python, Data Structures, Mathematics, Operating Systems, Object Oriented Programming.",
    "admission_process": "To apply, fill the online application form, upload required documents, pay the application fee, and appear for the entrance exam.",
    "mode_of_admission": "Admissions are through a valid entrance exam score or based on merit in qualifying exams as per university rules.",
    "seat_availability": "There are 60 seats available in the MCA program each academic year.",
    "faculty": "Our faculty includes experienced professors and industry experts dedicated to quality education.",
    "campus_facilities": "Campus facilities include well-equipped computer labs, library, sports grounds, Wi-Fi, and cafeteria.",
    "internship": "Students get internship opportunities with partner IT companies during the summer semester."
}